Revit 2026 API

# RibbonItemEventArgs Class

---

The base class of the RibbonItem event arguments which have UIApplication property.

SystemObject SystemEventArgs Autodesk.Revit.UI.EventsRibbonItemEventArgs Autodesk.Revit.UI.EventsComboBoxCurrentChangedEventArgs Autodesk.Revit.UI.EventsComboBoxDropDownClosedEventArgs Autodesk.Revit.UI.EventsComboBoxDropDownOpenedEventArgs Autodesk.Revit.UI.EventsTextBoxEnterPressedEventArgs

**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RibbonItemEventArgs : EventArgs
```
```vb
Public Class RibbonItemEventArgs
	Inherits EventArgs
```
```cpp
public ref class RibbonItemEventArgs : public EventArgs
```
```fsharp
type RibbonItemEventArgs =
    class
        inherit EventArgs
    end
```

The RibbonItemEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RibbonItemEventArgs | Initializes a new instance of the RibbonItemEventArgs class |

|  | Name | Description |
| --- | --- | --- |
|  | Application | The current UIApplication. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI.Events Namespace